data-asplos/tyche/lighttpd-100K.txt
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   329.17ms   78.02ms   1.82s    79.94%
    Req/Sec   111.33     99.50   363.00     59.13%
  135426 requests in 2.00m, 12.96GB read
  Socket errors: connect 0, read 0, write 0, timeout 918
Requests/sec:   1127.62
Transfer/sec:    110.54MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   338.15ms  120.89ms   1.96s    86.46%
    Req/Sec   107.06     97.78   525.00     74.41%
  135566 requests in 2.00m, 12.98GB read
  Socket errors: connect 0, read 0, write 0, timeout 1203
Requests/sec:   1128.94
Transfer/sec:    110.66MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   343.82ms  141.32ms   1.99s    87.92%
    Req/Sec   100.41     94.54   530.00     78.58%
  135546 requests in 2.00m, 12.98GB read
  Socket errors: connect 0, read 0, write 0, timeout 1060
Requests/sec:   1128.61
Transfer/sec:    110.63MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   339.90ms  131.22ms   1.98s    84.22%
    Req/Sec   105.58     88.48   393.00     67.98%
  135557 requests in 2.00m, 12.98GB read
  Socket errors: connect 0, read 0, write 0, timeout 1088
Requests/sec:   1128.74
Transfer/sec:    110.64MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   339.55ms  127.01ms   2.00s    87.09%
    Req/Sec   102.94     93.92   494.00     77.30%
  135464 requests in 2.00m, 12.97GB read
  Socket errors: connect 0, read 0, write 0, timeout 1174
Requests/sec:   1128.01
Transfer/sec:    110.59MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   340.82ms  130.69ms   1.99s    87.00%
    Req/Sec   103.69     93.40   415.00     62.65%
  135571 requests in 2.00m, 12.97GB read
  Socket errors: connect 0, read 0, write 0, timeout 1138
Requests/sec:   1128.83
Transfer/sec:    110.60MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   344.75ms  146.08ms   1.99s    88.52%
    Req/Sec   107.15     97.67   400.00     74.88%
  135628 requests in 2.00m, 12.98GB read
  Socket errors: connect 0, read 0, write 0, timeout 1050
Requests/sec:   1129.32
Transfer/sec:    110.66MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   337.78ms  124.98ms   1.93s    84.00%
    Req/Sec   101.79     85.13   380.00     69.66%
  135561 requests in 2.00m, 12.97GB read
  Socket errors: connect 0, read 0, write 0, timeout 1105
Requests/sec:   1128.74
Transfer/sec:    110.60MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   340.03ms  129.14ms   1.98s    85.21%
    Req/Sec   103.54     87.62   424.00     69.82%
  135549 requests in 2.00m, 12.98GB read
  Socket errors: connect 0, read 0, write 0, timeout 1096
Requests/sec:   1128.73
Transfer/sec:    110.64MB
Running 2m test @ http://128.178.116.234:8000/random/100K.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   337.76ms  119.02ms   2.00s    85.97%
    Req/Sec   103.68     96.71   444.00     76.99%
  135565 requests in 2.00m, 12.98GB read
  Socket errors: connect 0, read 0, write 0, timeout 1192
Requests/sec:   1129.17
Transfer/sec:    110.69MB