data-asplos/tyche/lighttpd-1M.txt
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.90s   128.63ms   2.00s    82.49%
    Req/Sec    20.90     23.94   161.00     84.17%
  12949 requests in 2.00m, 12.87GB read
  Socket errors: connect 0, read 155, write 0, timeout 12772
Requests/sec:    107.82
Transfer/sec:    109.71MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.41s   419.08ms   2.00s    63.18%
    Req/Sec    14.20     12.94   161.00     84.30%
  13008 requests in 2.00m, 12.89GB read
  Socket errors: connect 0, read 0, write 0, timeout 8682
Requests/sec:    108.34
Transfer/sec:    109.96MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.26s    41.08ms   2.00s    94.78%
    Req/Sec    22.46     22.74   151.00     84.70%
  12867 requests in 2.00m, 12.86GB read
  Socket errors: connect 0, read 12, write 0, timeout 3537
Requests/sec:    107.15
Transfer/sec:    109.66MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   862.25ms  413.24ms   1.97s    81.83%
    Req/Sec    16.98     22.97   290.00     89.82%
  13032 requests in 2.00m, 12.97GB read
  Socket errors: connect 0, read 0, write 0, timeout 10748
Requests/sec:    108.51
Transfer/sec:    110.55MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.35s    27.70ms   1.99s    92.33%
    Req/Sec    27.06     35.10   202.00     85.50%
  13013 requests in 2.00m, 12.87GB read
  Socket errors: connect 0, read 26, write 0, timeout 1950
Requests/sec:    108.36
Transfer/sec:    109.76MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.39s   413.64ms   2.00s    62.04%
    Req/Sec    14.49     12.98   180.00     83.96%
  12985 requests in 2.00m, 12.90GB read
  Socket errors: connect 0, read 0, write 0, timeout 8559
Requests/sec:    108.15
Transfer/sec:    110.03MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.37s   388.64ms   1.99s    69.41%
    Req/Sec    20.62     18.53   190.00     75.36%
  12892 requests in 2.00m, 12.84GB read
  Socket errors: connect 0, read 12, write 0, timeout 4596
Requests/sec:    107.35
Transfer/sec:    109.51MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   896.54ms  238.48ms   1.99s    82.87%
    Req/Sec    24.94     26.16   191.00     87.43%
  13002 requests in 2.00m, 12.92GB read
  Socket errors: connect 0, read 8, write 0, timeout 4104
Requests/sec:    108.26
Transfer/sec:    110.14MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.03s   223.62ms   1.96s    88.99%
    Req/Sec    27.27     29.25   200.00     84.26%
  13031 requests in 2.00m, 12.90GB read
  Socket errors: connect 0, read 11, write 0, timeout 2937
Requests/sec:    108.51
Transfer/sec:    109.98MB
Running 2m test @ http://128.178.116.234:8000/random/1M.1.html
  12 threads and 400 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.53s    24.16ms   2.00s    94.86%
    Req/Sec    26.66     30.05   191.00     83.76%
  12898 requests in 2.00m, 12.87GB read
  Socket errors: connect 0, read 71, write 0, timeout 1571
Requests/sec:    107.40
Transfer/sec:    109.74MB